<template>
  <div class="app-container" id="main">
  </div>
</template>
<script>

    // 引入 echarts 核心模块，核心模块提供了 echarts 使用必须要的接口。
    import * as echarts from 'echarts/core';
    // 引入饼图图表，图表后缀都为 Chart
    import { PieChart } from 'echarts/charts';
    // 引入提示框，标题，直角坐标系，数据集，内置数据转换器组件，组件后缀都为 Component
    import {
      TitleComponent,
      TooltipComponent,
      GridComponent,
      DatasetComponent,
      TransformComponent
    } from 'echarts/components';
    // 标签自动布局，全局过渡动画等特性
    import { LabelLayout, UniversalTransition } from 'echarts/features';
    // 引入 Canvas 渲染器，注意引入 CanvasRenderer 或者 SVGRenderer 是必须的一步
    import { CanvasRenderer } from 'echarts/renderers';


    export default {
      created () {
        // 注册必须的组件
        echarts.use([
          TitleComponent,
          PieChart,
          TooltipComponent,
          GridComponent,
          DatasetComponent,
          TransformComponent,
          BarChart,
          LabelLayout,
          UniversalTransition,
          CanvasRenderer,
        ]);

      },
      mounted () {
        // 初始化图表，设置配置项
        var myChart = echarts.init(document.getElementById('main'));
        let option ={
          title: {
          text: "地域消费分析",
          left: "center"
        },
        yAxis: {
          type: 'value',
        },
        xAxis: {
          type: 'category',
          axisLabel: { interval: 0 },
          data: ['北京', '\n天津', '河北', '\n山西', '内蒙古', '\n辽宁', '吉林', '\n黑龙江', '上海', '\n江苏', '浙江', '\n安徽', '福建', '\n江西', '山东', '\n河南', '湖北', '\n湖南', '广东', '\n广西', '海南', '\n重庆', '四川', '\n贵州', '云南', '\n西藏', '陕西', '\n甘肃', '青海', '\n宁夏', '新疆','\n台湾','香港','\n澳门']
        },
        dataGroupId: '',
        animationDurationUpdate: 500,
        series: {
          type: 'bar',
          id: 'sales',
          data: [
            {value: 16645,groupId: '北京'},
            {value: 19135,groupId: '天津'},
            {value: 15646,groupId: '河北'},
            {value: 22542,groupId: '山西'},
            {value: 25415,groupId: '内蒙古'},
            {value: 36855,groupId: '辽宁'},
            {value: 19655,groupId: '吉林'},
            {value: 17335,groupId: '黑龙江'},
            {value: 20405,groupId: '上海'},
            {value: 19995,groupId: '江苏'},
            {value: 18885,groupId: '浙江'},
            {value: 17775,groupId: '安徽'},
            {value: 11115,groupId: '福建'},
            {value: 11005,groupId: '江西'},
            {value: 20145,groupId: '山东'},
            {value: 32545,groupId: '河南'},
            {value: 11045,groupId: '湖北'},
            {value: 12545,groupId: '湖南'},
            {value: 23015,groupId: '广东'},
            {value: 19995,groupId: '广西'},
            {value: 20005,groupId: '海南'},
            {value: 20415,groupId: '重庆'},
            {value: 30475,groupId: '四川'},
            {value: 24715,groupId: '贵州'},
            {value: 21035,groupId: '云南'},
            {value: 18745,groupId: '西藏'},
            {value: 15325,groupId: '陕西'},
            {value: 29515,groupId: '甘肃'},
            {value: 19995,groupId: '青海'},
            {value: 10355,groupId: '宁夏'},
            {value: 21655,groupId: '新疆'},
            {value: 19525,groupId: '台湾'},
            {value: 33205,groupId: '香港'},
            {value: 19525,groupId: '澳门'},

          ],
          universalTransition: {
            enabled: true,
            divideShape: 'clone'
          },
          emphasis:{
              itemStyle: {
                color: '#d5e0b2',
              }
          }
        }
        }//option
        const drilldownData = [
          {
            dataGroupId: '北京',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '天津',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '河北',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '山西',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '内蒙古',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '辽宁',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '吉林',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '黑龙江',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '上海',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '江苏',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '浙江',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '安徽',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '福建',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '江西',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '山东',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '河南',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '湖北',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '广东',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '广西',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '海南',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '重庆',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '四川',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '贵州',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '云南',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '西藏',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '北京',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '陕西',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '甘肃',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '青海',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '宁夏',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '新疆',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '台湾',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '香港',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
          {
            dataGroupId: '澳门',
            data: [['服装鞋帽', 4],['日用百货', 2],['数码产品及其配件', 1],['手提包、箱包', 2],['妆品和美容产品', 11],['书箱音像制品', 11],['家用电器', 8],['食品、保健品', 5],['文体用品', 11]]
          },
        ];
        myChart.on('click', function (event) {
          if (event.data) {
            var subData = drilldownData.find(function (data) {
              return data.dataGroupId === event.data.groupId;
            });
            if (!subData) {
              return;
            }
            myChart.setOption({
              xAxis: {
                data: subData.data.map(function (item) {
                  return item[0];
                })
              },
              title: {
                text: event.data.groupId+'用户消费类别',
                left: "center"
              },
              series: {
                type: 'bar',
                id: 'sales',
                dataGroupId: subData.dataGroupId,
                data: subData.data.map(function (item) {
                  return item[1];
                }),
                universalTransition: {
                  enabled: true,
                  divideShape: 'clone'
                }
              },
              graphic: [
                {
                  type: 'text',
                  left: 50,
                  top: 20,
                  style: {
                    text: 'Back',
                    fontSize: 18
                  },
                  onclick: function () {
                    myChart.setOption(option);
                  }
                }
              ]
            });
          }
        });
        myChart.setOption(option);    //调用工具
      },
      name: '',
    }
</script>
<style scoped>
#main {
  height: 600px;
  margin-top: 50px;
}
</style>


